In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [4]:
data = pd.read_csv('data.csv')

In [5]:
data

            password strength
0           kzde5577        1
1           kino3434        1
2          visi7k1yr        1
3           megzy123        1
4        lamborghin1        1
...              ...      ...
669874    10redtux10        1
669875     infrared1        1
669876  184520socram        1
669877     marken22a        1
669878      fxx4pw4g        1

[669879 rows x 2 columns]

In [6]:
data.isna().sum()

password     3
strength    63
dtype: int64

In [7]:
data.dropna(how='any',inplace=True)

In [8]:
data.isna().sum()

password    0
strength    0
dtype: int64

In [9]:
data.strength.value_counts()

1                            496749
0                             89668
2                             82929
n                                 5
l&#305                            4
                              ...
axiselo@hotmail.com               1
metaren@yandex.com                1
melchazli@gmail.com               1
kralaidcop@gmail.com              1
efsane.mardinli@gmail.com         1
Name: strength, Length: 445, dtype: int64

In [10]:
data= data.loc[(data.strength == '1') | (data.strength == '2') | (data.strength == '0'),:]

In [13]:
data.strength.value_counts()

1    496749
0     89668
2     82929
Name: strength, dtype: int64

In [11]:
data

            password strength
0           kzde5577        1
1           kino3434        1
2          visi7k1yr        1
3           megzy123        1
4        lamborghin1        1
...              ...      ...
669874    10redtux10        1
669875     infrared1        1
669876  184520socram        1
669877     marken22a        1
669878      fxx4pw4g        1

[669346 rows x 2 columns]

In [12]:
data.to_csv("training2.csv")